content/articles/2021/reconfiguring_emacs/index.org
#+title: Configuring Emacs
#+subtitle: I just figured out use-package
#+tags: emacs
#+date: 2021-02-14
#+draft: true

* Seperate out =customize= stuff

Here you need to make sure that you have a =~/.emacs.d/custom-file.el=
for =M-x customize= to store things from.

#+begin_src elisp :tangle init.el
(setq custom-file "~/.emacs.d/custom-file.el")
(load-file custom-file)
#+end_src

* Move backups to a seperate directory

#+begin_src elisp :tangle init.el
;; Backups
(setq
   backup-by-copying t      ; don't clobber symlinks
   backup-directory-alist
    '(("." . "~/.saves/"))    ; don't litter my fs tree
   delete-old-versions t
   kept-new-versions 6
   kept-old-versions 2
   version-control t)
#+end_src

* Set some tab stuff

#+begin_src elisp :tangle init.el
;; https://www.emacswiki.org/emacs/NoTabs
(setq-default indent-tabs-mode nil)

;; https://www.emacswiki.org/emacs/TabStopList
(setq tab-stop-list (number-sequence 2 120 2))
#+end_src

* Add your functions

#+begin_src elisp :tangle init.el
(load-file "~/.emacs.d/functions.el")
(load-file "~/.emacs.d/shortcuts.el")
(load-file "~/.emacs.d/blog.el")

#+end_src

* Initialize packages and their sources

Here we tell emacs where we want to get packages from, and install
=use-package= if it hasn't been already.

#+begin_src elisp :tangle init.el
(package-initialize)
(add-to-list 'package-archives
             '("gnu" . "http://elpa.gnu.org/packages/") t)

(add-to-list 'package-archives
             '("melpa" . "http://melpa.org/packages/") t)

(add-to-list 'package-archives
             '("stable melpa" . "http://stable.melpa.org/packages/") t)

(when (not (package-installed-p 'use-package))
  (package-refresh-contents)
  (package-install 'use-package))
#+end_src

* Dashboard

#+begin_src elisp :tangle init.el
;; Startup Screen
(use-package all-the-icons
  :ensure t)

(use-package projectile
  :ensure t
  :init
  (projectile-mode +1)
  :bind (:map projectile-mode-map
              ("C-c p" . projectile-command-map)))

(use-package dashboard
  :ensure t
  :config
  (setq dashboard-banner-logo-title "Welcome to Emacs Dashboard")
  ;; Set the banner
  (setq dashboard-startup-banner 'logo)
  (setq dashboard-items '((recents  . 5)
                        (bookmarks . 5)
                        (projects . 5)
                        (agenda . 5)))
  (setq dashboard-set-heading-icons t)
  (setq dashboard-set-file-icons t)
  (dashboard-setup-startup-hook)
  )
#+end_src

* Org-mode

#+begin_src elisp :tangle init.el
;; Org mode
(use-package org
  :ensure t
  :bind (
	 ("C-c l" . org-store-link)
	 ("C-c a" . org-agenda)
	 ("C-c c" . org-capture))
  :config
  (require 'org-tempo)
  (setq org-startup-indented t) ; Enable `org-indent-mode' by default
  (setq org-log-done t) ; Set time for when things were completed
  (setq org-hide-emphasis-markers t) ; Not show typographical commands
  (setq org-plantuml-jar-path (expand-file-name "/usr/share/plantuml/plantuml.jar"))
  )

(use-package org-superstar
  :ensure t
  :config
  (add-hook 'org-mode-hook (lambda () (org-superstar-mode 1))))

(setq org-capture-templates
      '(("t" "Todo" entry (file+headline "~/org/notes.org" "Tasks")
         "* TODO %?\n  %i\n  %a")
        ("i" "Idea" entry (file+headline "~/org/notes.org" "Ideas")
         "* TODO %?\n  %i\n  %a")
        ("w" "Work Task" entry (file+datetree "~/org/work.org")
         "* TODO %?\n  %i\n  %a")
        ("j" "Journal" entry (file+datetree "~/org/journal.org")
         "* %?\nEntered on %U\n  %i\n  %a")))
#+end_src

* RSS Reader

#+begin_src elisp :tangle init.el
;; elfeed

(defun elfeed-eww-browse ()
  "Wrapper to open eww and mark elfeed as read"
  (interactive)
  (let ((link (elfeed-entry-link elfeed-show-entry)))
    (when link
      (eww-browse-url link))))

(use-package elfeed
  :ensure t
  :bind (
	 ("C-x w" . elfeed))
  :config
  (define-key elfeed-show-mode-map (kbd "B") 'elfeed-eww-browse)
  )

(use-package elfeed-org
  :ensure t
  :config
  (elfeed-org))
#+end_src

* Magit

So small, but so awesome

#+begin_src elisp :tangle init.el
(use-package magit
  :ensure t
  :bind ("C-x g" . magit-status))

#+end_src

* Theme

#+begin_src elisp :tangle init.el
(use-package modus-vivendi-theme
  :ensure t
  :config
  (load-theme 'modus-vivendi 'no-confirm))

#+end_src

* PDF Reading

#+begin_src elisp :tangle init.el
(use-package pdf-tools
  :ensure t
  :config
  (pdf-tools-install))

(use-package org-pdftools
  :ensure t
  :hook (org-load . org-pdftools-setup-link))
#+end_src

* Limited helm

#+begin_src elisp :tangle init.el
(use-package helm-ls-git
  :ensure t
  :bind (
         ( "C-x C-d" . helm-browse-project ))
  :config
  (require 'helm-config))

(use-package helm-ag
  :ensure t
  :bind
         ( "C-x f" . helm-ag-project-root))
  
(use-package company
  :ensure t
  :bind (:map company-active-map
         ("C-n" . company-select-next)
         ("C-p" . company-select-previous))
  :config
  (setq company-idle-delay 0.3)
  (global-company-mode t))
#+end_src

* Set =PATH= correctly

#+begin_src elisp :tangle init.el
(use-package exec-path-from-shell
  :ensure t
  :config
  (exec-path-from-shell-copy-env "PATH"))
#+end_src

* Docker

#+begin_src elisp :tangle init.el
(use-package docker
  :ensure t
  :bind ("C-c C-d" . docker))
#+end_src

* Web Editing

#+begin_src elisp :tangle init.el
(use-package yaml-mode
  :ensure t)

(use-package web-mode
  :ensure t
  :config
  (add-to-list 'auto-mode-alist '("\\.phtml\\'" . web-mode))
  (add-to-list 'auto-mode-alist '("\\.tpl\\.php\\'" . web-mode))
  (add-to-list 'auto-mode-alist '("\\.[agj]sp\\'" . web-mode))
  (add-to-list 'auto-mode-alist '("\\.as[cp]x\\'" . web-mode))
  (add-to-list 'auto-mode-alist '("\\.erb\\'" . web-mode))
  (add-to-list 'auto-mode-alist '("\\.mustache\\'" . web-mode))
  (add-to-list 'auto-mode-alist '("\\.djhtml\\'" . web-mode))
  (add-to-list 'auto-mode-alist '("\\.html?\\'" . web-mode)))
#+end_src
* Shell Commands

#+begin_src elisp :tangle init.el
(use-package exec-path-from-shell
  :ensure t
  :config
  (exec-path-from-shell-copy-env "PATH"))
#+end_src

* Vterm

#+begin_src bash
sudo apt-get install libvterm-dev
#+end_src

#+begin_src elisp

#+end_src
* References

1. https://www.masteringemacs.org/article/spotlight-use-package-a-declarative-configuration-tool
2. https://suvratapte.medium.com/configuring-emacs-from-scratch-use-package-c30382297877
3. http://cachestocaches.com/2015/8/getting-started-use-package/
4. https://suvratapte.medium.com/configuring-emacs-from-scratch-use-package-c30382297877
5. https://dustinlacewell.github.io/emacs.d/#org02c2dff

# Local Variables:
# eval: (add-hook 'after-save-hook (lambda ()(org-babel-tangle)) nil t)
# End:
